'''
철수 = 12/7
영희 = 19/9
결과 = 영희 > 철수
print(결과)
'''
'''
print('------[연습문제]-------')
print('모두 True가 되도록 아래식의 숫자를 변경하시오.')

print(1 < 3) 
print(12 > 3) 
print(1 != 3) 
print(3 == 3) 
print(1 <= 3) 
print(12 >= 3)
'''
'''
삼각형 =3*6 /2
print(삼각형 %2 == 1)
'''
'''
분 = 321321 % 3600 // 60  # 시간을 제외한 이므로 시의 나머지를 주고 그 나머지는 분의 몫이 된다
초 = 321321 %  60  # 시간과 분을 제외한 이므로 %

덧셈 = 분 + 초

print(덧셈 > 100)
'''
'''
작년연봉 = 970
올해연봉 = 970 + (970 * 11/100)

올해평균월급 = 91
올해평균연봉 = 91 * 12

print(올해연봉 > 올해평균연봉)
'''
'''
자동차 = 154/78
트럭 = 215 / (120+17)

print(자동차 > 트럭)
'''
#지금 초 단위에서 시작한다는 걸 알아야한다~
'''
시간 = 321321
분 =  321321 % 3600 // 60
초 = 시간 % 60 
합 = 분 + 초
print(합 > 100)
'''
'''
a = 0
print(2 * a > 3 - a)
a = 2
print(2 * a > 3 - a)
'''



'''
a = 0
print( 5*a - 2 == 3 * ( 4*a  + 4))

5*a - 2 == 3 * ( 4*a  + 4)
'''
'''
5a -2 == 12a + 12
-7a = 14
a = -2

'''
'''
a= -2
print( 5*a - 2 == 3 * ( 4*a  + 4))
'''

'''
풀이
30000 -4*n = 2000
28000 = 4n
n = 7000
'''
'''
현금 = 30000
잔돈 = 2000
총인원 = 4
돈가스가격 = (현금-잔돈) / 4
print(돈가스가격)
'''

'''
	[미지수가 양쪽에 있는 일차방정식]
    다음 방정식의 풀이 과정을 주석으로 표현하시오.
'''	
'''    
b = 0
print(-4 * b + 3 == -2 * (b - 2))
'''

'''
  -4b + 3 == -2b +4
  -2b == 1
  b == -1/2
'''
'''
b = -1/2
print(-4 * b + 3 == -2 * (b - 2))
'''
'''
c = 0
print(-c + 3 == -3 * (2 * c + 4))
'''
'''
-c + 3 == -3(2c +4)
-c + 3 == -6c -12
15 == -5c
c == -3
'''
'''
c = -3
print(-c + 3 == -3 * (2 * c + 4))
'''
'''
chulsoo = 13
father = 45

n = 3
print(45 + n == 3*(13+n))
'''
'''
[solves]
45 + n = 3( 13+n)
45 + n = 39 + 3n
6 = 2n
n = 3
'''



'''
2 + 5*x  >= 30
5x >= 28
x >= 28/5  = 5.6

'''
'''
상자 = 2
물건 = 5
전체 = 30
물건갯수 = 6

print(상자 + 물건 * 물건갯수 >= 전체 )
'''
'''
n = -2
print(2*n > n -3)
'''

'''
2n > n -3
n > -3
n = -2
'''

'''
현금 = 20000
오이수 = 9
거스름돈 = 2000

오이가격= 2000 

현금 - 거스름돈 == 오이수 * 오이가격
(현금 - 거스름돈)/오이수 == 오이가격


print(현금 - 거스름돈 == 오이수 * 오이가격)
'''

a = 1000
b = 500
